import * as React from 'react';
import { styled } from '@mui/material/styles';
import Card from '@mui/material/Card';
import CardHeader from '@mui/material/CardHeader';
import CardMedia from '@mui/material/CardMedia';
import CardContent from '@mui/material/CardContent';
import CardActions from '@mui/material/CardActions';
import Collapse from '@mui/material/Collapse';
import Avatar from '@mui/material/Avatar';
import IconButton from '@mui/material/IconButton';
import Typography from '@mui/material/Typography';
import { red } from '@mui/material/colors';
import FavoriteIcon from '@mui/icons-material/Favorite';
import ShareIcon from '@mui/icons-material/Share';
import ExpandMoreIcon from '@mui/icons-material/ExpandMore';
import MoreVertIcon from '@mui/icons-material/MoreVert';
import ImageCard from '../images/scout.png';

const ExpandMore = styled((props) => {
  const { expand, ...other } = props;
  return <IconButton {...other} />;
})(({ theme, expand }) => ({
  transform: !expand ? 'rotate(0deg)' : 'rotate(180deg)',
  marginLeft: 'auto',
  transition: theme.transitions.create('transform', {
    duration: theme.transitions.duration.shortest,
  }),
}));

export default function RecipeReviewCard() {
  const [expanded, setExpanded] = React.useState(false);

  const handleExpandClick = () => {
    setExpanded(!expanded);
  };

  return (
    <Card sx={{ maxWidth: 345 }}>
      <CardHeader
        avatar={
          <Avatar sx={{ bgcolor: red[500] }} aria-label="recipe">
            S
          </Avatar>
        }
        action={
          <IconButton aria-label="settings">
            <MoreVertIcon />
          </IconButton>
        }
        title="الكشافة التونسية"
        subheader="September 14, 2016"
      />
      <CardMedia
        component="img"
        height="194"
        image={ImageCard}
        alt="Paella dish"
      />
      <CardContent>
        <Typography variant="body2" color="text.secondary">
        الكشافة التونسية تطلق مشروعا للحد من ظاهرة الانقطاع المبكّر عن الدراسة المشاركين فيه، ان آخر الاحصائيات جاءت مفزعة وكشفت ان جهة صفاقس مصنفة الثانية، بعد ولاية جندوبة، من حيث عدد الأطفال المنقطعين عن الدراسة والمتعاطين لانشطة اقتصادية هشة بمقابل زهيد، ليصبح من الضروري التفكير وإيجا
        </Typography>
      </CardContent>
      <CardActions disableSpacing>
        <IconButton aria-label="add to favorites">
          <FavoriteIcon />
        </IconButton>
        <IconButton aria-label="share">
          <ShareIcon />
        </IconButton>
        <ExpandMore
          expand={expanded}
          onClick={handleExpandClick}
          aria-expanded={expanded}
          aria-label="show more"
        >
          <ExpandMoreIcon />
        </ExpandMore>
      </CardActions>
      <Collapse in={expanded} timeout="auto" unmountOnExit>
        <CardContent>
          <Typography paragraph>برنامج لفائدة</Typography>
          <Typography paragraph>
          وبيّن أن أنشطة هذا المشروع الذي ينفّذ بالشراكة مع مشروع "بروتاكت" التابع لمنظمة العمل الدولية، سوف ترتكز على 3 محاور أساسية وهي: بعث خلايا الأمل لافواج كشفية داخل الاعداديات والمعاهد الثانوية لرصد الحالات المنقطعين عن التعليم، وتركيز أفواج كشفية ترابية بمناطق وعمادات صفاقس لرصد حالات الأطفال المنقطعين عن الدراسة واقناعهم بالالتحاق بمراكز التكوين، وإعداد برنامج لفائدة عدد من الأمهات من أجل تكوينهن في حرف سريعة
وأبرز، في هذا الصدد، أن البرنامج المخصّص للأمهات يهدف إلى تطوير قدراتهن ومساعدتهن لبعث مشاريع تضمن لهن ولعائلاتهن العيش الكريم، مشيرا إلى أنه سيتم في إطار ذات البرنامج بعث سوق افتراضية تضمّ ما بين 6 آلاف و10 آلاف قائد وكشاف يعنون بتكوين الأمهات محدودات الدخل.
هذا وتمحور النقاش خلال هذا اللقاء الاعلامي، الذي خصص للاعلان عن إطلاق مشروع "فرصة جديدة، امل جديد"، عن ديمومة المشروع في ظل ثقافة العمل السائدة في اوساط عائلات جهة صفاقس، والتفكير في تنظيم حلقات تدريبية لفائدة الإطارات التربوية حول التحسيس بخطورة الانقطاع المبكر عن التعليم للاطفال، والسعي إلى رصد هذه الحالات وتأطيرها، فضلا عن التفكير في التمديد في فترة هذا المشروع.s.
          </Typography>
          <Typography paragraph>
          وبيّن أن أنشطة هذا المشروع الذي ينفّذ بالشراكة مع مشروع "بروتاكت" التابع لمنظمة العمل الدولية، سوف ترتكز على 3 محاور أساسية وهي: بعث خلايا الأمل لافواج كشفية داخل الاعداديات والمعاهد الثانوية لرصد الحالات المنقطعين عن التعليم، وتركيز أفواج كشفية ترابية بمناطق وعمادات صفاقس لرصد حالات الأطفال المنقطعين عن الدراسة واقناعهم بالالتحاق بمراكز التكوين، وإعداد برنامج لفائدة عدد من الأمهات من أجل تكوينهن في حرف سريعة
وأبرز، في هذا الصدد، أن البرنامج المخصّص للأمهات يهدف إلى تطوير قدراتهن ومساعدتهن لبعث مشاريع تضمن لهن ولعائلاتهن العيش الكريم، مشيرا إلى أنه سيتم في إطار ذات البرنامج بعث سوق افتراضية تضمّ ما بين 6 آلاف و10 آلاف قائد وكشاف يعنون بتكوين الأمهات محدودات الدخل.
هذا وتمحور النقاش خلال هذا اللقاء الاعلامي، الذي خصص للاعلان عن إطلاق مشروع "فرصة جديدة، امل جديد"، عن ديمومة المشروع في ظل ثقافة العمل السائدة في اوساط عائلات جهة صفاقس، والتفكير في تنظيم حلقات تدريبية لفائدة الإطارات التربوية حول التحسيس بخطورة الانقطاع المبكر عن التعليم للاطفال، والسعي إلى رصد هذه الحالات وتأطيرها، فضلا عن التفكير في التمديد في فترة هذا المشروع..
          </Typography>
          <Typography paragraph>
          وبيّن أن أنشطة هذا المشروع الذي ينفّذ بالشراكة مع مشروع "بروتاكت" التابع لمنظمة العمل الدولية، سوف ترتكز على 3 محاور أساسية وهي: بعث خلايا الأمل لافواج كشفية داخل الاعداديات والمعاهد الثانوية لرصد الحالات المنقطعين عن التعليم، وتركيز أفواج كشفية ترابية بمناطق وعمادات صفاقس لرصد حالات الأطفال المنقطعين عن الدراسة واقناعهم بالالتحاق بمراكز التكوين، وإعداد برنامج لفائدة عدد من الأمهات من أجل تكوينهن في حرف سريعة
وأبرز، في هذا الصدد، أن البرنامج المخصّص للأمهات يهدف إلى تطوير قدراتهن ومساعدتهن لبعث مشاريع تضمن لهن ولعائلاتهن العيش الكريم، مشيرا إلى أنه سيتم في إطار ذات البرنامج بعث سوق افتراضية تضمّ ما بين 6 آلاف و10 آلاف قائد وكشاف يعنون بتكوين الأمهات محدودات الدخل.
هذا وتمحور النقاش خلال هذا اللقاء الاعلامي، الذي خصص للاعلان عن إطلاق مشروع "فرصة جديدة، امل جديد"، عن ديمومة المشروع في ظل ثقافة العمل السائدة في اوساط عائلات جهة صفاقس، والتفكير في تنظيم حلقات تدريبية لفائدة الإطارات التربوية حول التحسيس بخطورة الانقطاع المبكر عن التعليم للاطفال، والسعي إلى رصد هذه الحالات وتأطيرها، فضلا عن التفكير في التمديد في فترة هذا المشروع.
          </Typography>
          <Typography>
          وبيّن أن أنشطة هذا المشروع الذي ينفّذ بالشراكة مع مشروع "بروتاكت" التابع لمنظمة العمل الدولية، سوف ترتكز على 3 محاور أساسية وهي: بعث خلايا الأمل لافواج كشفية داخل الاعداديات والمعاهد الثانوية لرصد الحالات المنقطعين عن التعليم، وتركيز أفواج كشفية ترابية بمناطق وعمادات صفاقس لرصد حالات الأطفال المنقطعين عن الدراسة واقناعهم بالالتحاق بمراكز التكوين، وإعداد برنامج لفائدة عدد من الأمهات من أجل تكوينهن في حرف سريعة
وأبرز، في هذا الصدد، أن البرنامج المخصّص للأمهات يهدف إلى تطوير قدراتهن ومساعدتهن لبعث مشاريع تضمن لهن ولعائلاتهن العيش الكريم، مشيرا إلى أنه سيتم في إطار ذات البرنامج بعث سوق افتراضية تضمّ ما بين 6 آلاف و10 آلاف قائد وكشاف يعنون بتكوين الأمهات محدودات الدخل.
هذا وتمحور النقاش خلال هذا اللقاء الاعلامي، الذي خصص للاعلان عن إطلاق مشروع "فرصة جديدة، امل جديد"، عن ديمومة المشروع في ظل ثقافة العمل السائدة في اوساط عائلات جهة صفاقس، والتفكير في تنظيم حلقات تدريبية لفائدة الإطارات التربوية حول التحسيس بخطورة الانقطاع المبكر عن التعليم للاطفال، والسعي إلى رصد هذه الحالات وتأطيرها، فضلا عن التفكير في التمديد في فترة هذا المشروع.
          </Typography>
        </CardContent>
      </Collapse>
    </Card>
  );
}
